SEMESTER-2/Big Data/big-data-exercises-pxl.gitlab.io-master-public/public/mongodb/2-Herhalingsoefeningen.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-08-14 Wed 16:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Oefeningen MongoDB - Herhalingsoefeningen MongoDB</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Robin Wils" />
<link rel="stylesheet" type="text/css" href="../solarized-dark.min.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Oefeningen MongoDB - Herhalingsoefeningen MongoDB</h1>
<hr />
<p>
<a href="../index.html">Home</a> &gt; <a href="mongodb.html">MongoDB</a> &gt; Herhalingsoefeningen <br />
<a href="https://pxl-college-projects.gitlab.io/big-data-exercises-pxl.gitlab.io/mongodb/2-Herhalingsoefeningen.org">View org source</a>
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc7728eb">Opgave 1</a></li>
<li><a href="#org291ebc6">Opgave 2</a></li>
<li><a href="#orga1fb46e">Opgave 3</a></li>
<li><a href="#orgd2c0c46">Opgave 4</a></li>
<li><a href="#org9a170c1">Opgave 5</a></li>
<li><a href="#org5731eaa">Opgave 6</a></li>
<li><a href="#org0243a6b">Opgave 7</a></li>
<li><a href="#org1b943d7">Opgave 8</a></li>
<li><a href="#org2805c84">Opgave 9</a></li>
<li><a href="#org5b6cb40">Opgave 10</a></li>
<li><a href="#orgb0dfcfb">Opgave 11</a></li>
<li><a href="#org464119f">Opgave 12</a></li>
<li><a href="#org0e10d82">Opgave 13</a></li>
<li><a href="#orgc159661">Opgave 14</a></li>
<li><a href="#orgf4e07db">Opgave 15</a></li>
<li><a href="#org71742bf">Opgave 16</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc7728eb" class="outline-2">
<h2 id="orgc7728eb">Opgave 1</h2>
<div class="outline-text-2" id="text-orgc7728eb">
<p>
Geef een overzicht van de aanwezigen databanken.
</p>

<div class="org-src-container">
<pre class="src src-mongo">show dbs
</pre>
</div>
</div>
</div>

<div id="outline-container-org291ebc6" class="outline-2">
<h2 id="org291ebc6">Opgave 2</h2>
<div class="outline-text-2" id="text-org291ebc6">
<p>
Maak een databank aan met de naam 'pokemon'.
</p>

<div class="org-src-container">
<pre class="src src-mongo">use pokemon
</pre>
</div>
</div>
</div>

<div id="outline-container-orga1fb46e" class="outline-2">
<h2 id="orga1fb46e">Opgave 3</h2>
<div class="outline-text-2" id="text-orga1fb46e">
<p>
Maak in de databank ‘pokemon’ een collection met naam ‘pokedex’.
</p>

<div class="org-src-container">
<pre class="src src-mongo">db.createCollection(<span style="color: #528B8B;">"pokedex"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd2c0c46" class="outline-2">
<h2 id="orgd2c0c46">Opgave 4</h2>
<div class="outline-text-2" id="text-orgd2c0c46">
<p>
Voeg een document toe met volgende kenmerken:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Name:</td>
<td class="org-left">Pikachu</td>
</tr>

<tr>
<td class="org-left">Type:</td>
<td class="org-left">electric</td>
</tr>

<tr>
<td class="org-left">Weakness:</td>
<td class="org-left">ground</td>
</tr>
</tbody>
</table>

<p>
Laat het object-id door mongodb creëren.
</p>

<div class="org-src-container">
<pre class="src src-mongo">db.pokedex.insertOne({
  <span style="color: #528B8B;">"name"</span>: <span style="color: #528B8B;">"Pikachu"</span>,
  <span style="color: #528B8B;">"type"</span>: <span style="color: #528B8B;">"electric"</span>,  
  <span style="color: #528B8B;">"weakness"</span>: [<span style="color: #528B8B;">"ground"</span>]
})
</pre>
</div>
</div>
</div>

<div id="outline-container-org9a170c1" class="outline-2">
<h2 id="org9a170c1">Opgave 5</h2>
<div class="outline-text-2" id="text-org9a170c1">
<p>
Voeg een document toe met volgende kenmerken: <br />
</p>

<p>
Zorg ervoor dat je zelf het object-id toekent. Voor Charmander is dat ‘004’.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Name:</td>
<td class="org-left">Charmander</td>
</tr>

<tr>
<td class="org-left">Type:</td>
<td class="org-left">fire</td>
</tr>
</tbody>
</table>

<p>
Probeer eens om volgend document toe te voegen:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Object-id:</td>
<td class="org-left">004 (als tekst)</td>
</tr>

<tr>
<td class="org-left">Name:</td>
<td class="org-left">Charmander2</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-mongo">db.pokedex.insertOne({
  <span style="color: #528B8B;">"_id"</span>: <span style="color: #528B8B;">"004"</span>,
  <span style="color: #528B8B;">"name"</span>: <span style="color: #528B8B;">"Charmander"</span>,
  <span style="color: #528B8B;">"type"</span>: <span style="color: #528B8B;">"fire"</span>,
})
</pre>
</div>

<p>
<i>Deze functie geeft een error doordat er al een pokemon is met dat id.</i>
</p>
<div class="org-src-container">
<pre class="src src-mongo">db.pokedex.insertOne({
  <span style="color: #528B8B;">"_id"</span>: <span style="color: #528B8B;">"004"</span>,
  <span style="color: #528B8B;">"name"</span>: <span style="color: #528B8B;">"Charmander2"</span>
})
</pre>
</div>
</div>
</div>

<div id="outline-container-org5731eaa" class="outline-2">
<h2 id="org5731eaa">Opgave 6</h2>
<div class="outline-text-2" id="text-org5731eaa">
<p>
Voeg een document toe met volgende kenmerken:  
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Object-id:</td>
<td class="org-left">005</td>
</tr>

<tr>
<td class="org-left">Name:</td>
<td class="org-left">Charmeleon</td>
</tr>

<tr>
<td class="org-left">Type:</td>
<td class="org-left">fire</td>
</tr>

<tr>
<td class="org-left">Sort:</td>
<td class="org-left">flame</td>
</tr>

<tr>
<td class="org-left">Weakness:</td>
<td class="org-left">ground, rock, water</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-mongo">db.pokedex.insertOne({
  <span style="color: #528B8B;">"_id"</span>: <span style="color: #528B8B;">"005"</span>,
  <span style="color: #528B8B;">"name"</span>: <span style="color: #528B8B;">"Charmeleon"</span>,
  <span style="color: #528B8B;">"type"</span>: <span style="color: #528B8B;">"fire"</span>,
  <span style="color: #528B8B;">"sort"</span>: <span style="color: #528B8B;">"flame"</span>,
  <span style="color: #528B8B;">"weakness"</span>: [<span style="color: #528B8B;">"ground"</span>, <span style="color: #528B8B;">"rock"</span>, <span style="color: #528B8B;">"water"</span>]
})
</pre>
</div>
</div>
</div>

<div id="outline-container-org0243a6b" class="outline-2">
<h2 id="org0243a6b">Opgave 7</h2>
<div class="outline-text-2" id="text-org0243a6b">
<p>
Voeg via 1 instructie 2 documenten toe:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Object-id:</td>
<td class="org-left">007</td>
</tr>

<tr>
<td class="org-left">Name:</td>
<td class="org-left">Squirtle</td>
</tr>

<tr>
<td class="org-left">Type:</td>
<td class="org-left">water</td>
</tr>

<tr>
<td class="org-left">Sort:</td>
<td class="org-left">tiny turtle</td>
</tr>

<tr>
<td class="org-left">Evolution:</td>
<td class="org-left">Wartortle, Blastoise</td>
</tr>
</tbody>
</table>

<p>
<br />
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Object-id:</td>
<td class="org-left">008</td>
</tr>

<tr>
<td class="org-left">Name:</td>
<td class="org-left">Wartortle</td>
</tr>

<tr>
<td class="org-left">Type:</td>
<td class="org-left">water</td>
</tr>

<tr>
<td class="org-left">Weakness:</td>
<td class="org-left">electric</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-mongo">db.pokedex.insertMany([
  {
    <span style="color: #528B8B;">"_id"</span>: <span style="color: #528B8B;">"007"</span>, 
    <span style="color: #528B8B;">"name"</span>: <span style="color: #528B8B;">"Squirtle"</span>, 
    <span style="color: #528B8B;">"type"</span>: <span style="color: #528B8B;">"water"</span>,
    <span style="color: #528B8B;">"sort"</span>: <span style="color: #528B8B;">"tiny turtle"</span>,
    <span style="color: #528B8B;">"evolution"</span>: [<span style="color: #528B8B;">"Wartortle"</span>, <span style="color: #528B8B;">"Blastoise"</span>]
  },
  {
    <span style="color: #528B8B;">"_id"</span>: <span style="color: #528B8B;">"008"</span>, 
    <span style="color: #528B8B;">"name"</span>: <span style="color: #528B8B;">"Wartortle"</span>, 
    <span style="color: #528B8B;">"type"</span>: <span style="color: #528B8B;">"water"</span>,
    <span style="color: #528B8B;">"weakness"</span>: [<span style="color: #528B8B;">"electric"</span>]
  }
])
</pre>
</div>
</div>
</div>

<div id="outline-container-org1b943d7" class="outline-2">
<h2 id="org1b943d7">Opgave 8</h2>
<div class="outline-text-2" id="text-org1b943d7">
<p>
Wijzig het document met id 008. <br />
Voeg hieraan volgend key/value-pair: Evolution: Blastoise
</p>

<div class="org-src-container">
<pre class="src src-mongo">db.pokedex.update(
  {<span style="color: #528B8B;">"_id"</span>: <span style="color: #528B8B;">"008"</span>},
  {$set: {<span style="color: #528B8B;">"evolution"</span>: [<span style="color: #528B8B;">"Blastoise"</span>]}}
)
</pre>
</div>
</div>
</div>

<div id="outline-container-org2805c84" class="outline-2">
<h2 id="org2805c84">Opgave 9</h2>
<div class="outline-text-2" id="text-org2805c84">
<p>
Wijzig het document met id 008. <br />
Voeg een extra weakness toe: grass
</p>

<div class="org-src-container">
<pre class="src src-mongo">db.pokedex.update(
  {<span style="color: #528B8B;">"_id"</span>: <span style="color: #528B8B;">"008"</span>},
  {$set: {<span style="color: #528B8B;">"weakness.1"</span>: <span style="color: #528B8B;">"grass"</span>}}
)
</pre>
</div>
</div>
</div>

<div id="outline-container-org5b6cb40" class="outline-2">
<h2 id="org5b6cb40">Opgave 10</h2>
<div class="outline-text-2" id="text-org5b6cb40">
<p>
Wijzig alle documenten waarin het type ‘water’ is. <br />
Voeg een kenmerk toe: Capacity: torrent
</p>

<div class="org-src-container">
<pre class="src src-mongo">db.pokedex.update(
  {<span style="color: #528B8B;">"type"</span>: <span style="color: #528B8B;">"water"</span>},
  {$set: {<span style="color: #528B8B;">"capacity"</span>: <span style="color: #528B8B;">"torrent"</span>}},
  {multi:<span style="color: #BBAA97;">true</span>}
)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb0dfcfb" class="outline-2">
<h2 id="orgb0dfcfb">Opgave 11</h2>
<div class="outline-text-2" id="text-orgb0dfcfb">
<p>
Vervang het document met id ‘004’. Zorg voor volgende inhoud:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Object-id:</td>
<td class="org-left">004</td>
</tr>

<tr>
<td class="org-left">Name:</td>
<td class="org-left">Charmander</td>
</tr>

<tr>
<td class="org-left">Sort:</td>
<td class="org-left">lizard</td>
</tr>

<tr>
<td class="org-left">Weakness:</td>
<td class="org-left">ground, rock, water</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-mongo">db.pokedex.update(
  {<span style="color: #528B8B;">"_id"</span>: <span style="color: #528B8B;">"004"</span>},
  {
    <span style="color: #528B8B;">"name"</span>: <span style="color: #528B8B;">"Charmander"</span>,
    <span style="color: #528B8B;">"sort"</span>: <span style="color: #528B8B;">"lizard"</span>,
    <span style="color: #528B8B;">"weakness"</span>: [<span style="color: #528B8B;">"ground"</span>, <span style="color: #528B8B;">"rock"</span>, <span style="color: #528B8B;">"water"</span>]
  },
  {$unset: {<span style="color: #528B8B;">"type"</span>: <span style="color: #528B8B;">""</span>}}
)
</pre>
</div>
</div>
</div>

<div id="outline-container-org464119f" class="outline-2">
<h2 id="org464119f">Opgave 12</h2>
<div class="outline-text-2" id="text-org464119f">
<p>
Voeg via 1 instructie 2 documenten toe:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Object-id:</td>
<td class="org-left">010</td>
</tr>

<tr>
<td class="org-left">name:</td>
<td class="org-left">Caterpie</td>
</tr>

<tr>
<td class="org-left">Type:</td>
<td class="org-left">bug</td>
</tr>
</tbody>
</table>

<p>
<br />
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Object-id:</td>
<td class="org-left">011</td>
</tr>

<tr>
<td class="org-left">Name:</td>
<td class="org-left">Metapod</td>
</tr>

<tr>
<td class="org-left">Type:</td>
<td class="org-left">bug</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-mongo">db.pokedex.insertMany([
  {
    <span style="color: #528B8B;">"_id"</span>: <span style="color: #528B8B;">"010"</span>, 
    <span style="color: #528B8B;">"name"</span>: <span style="color: #528B8B;">"Caterpie"</span>, 
    <span style="color: #528B8B;">"type"</span>: <span style="color: #528B8B;">"bug"</span>
  },
  {
    <span style="color: #528B8B;">"_id"</span>: <span style="color: #528B8B;">"011"</span>, 
    <span style="color: #528B8B;">"name"</span>: <span style="color: #528B8B;">"Metapod"</span>, 
    <span style="color: #528B8B;">"type"</span>: <span style="color: #528B8B;">"bug"</span>
  }
])
</pre>
</div>
</div>
</div>

<div id="outline-container-org0e10d82" class="outline-2">
<h2 id="org0e10d82">Opgave 13</h2>
<div class="outline-text-2" id="text-org0e10d82">
<p>
Wijzig alle documenten waarin het type ‘bug’ is. <br />
Voeg volgende kenmerken toe:<br />
</p>
<ul class="org-ul">
<li>Sort: worm</li>
<li>Weakness: fire, flying, rock</li>
</ul>

<div class="org-src-container">
<pre class="src src-mongo">db.pokedex.update(
  {<span style="color: #528B8B;">"type"</span>: <span style="color: #528B8B;">"bug"</span>},
  {$set:{
    <span style="color: #528B8B;">"sort"</span>: <span style="color: #528B8B;">"worm"</span>,
    <span style="color: #528B8B;">"weakness"</span>: [<span style="color: #528B8B;">"fire"</span>, <span style="color: #528B8B;">"flying"</span>, <span style="color: #528B8B;">"rock"</span>]
  }},
  {multi:<span style="color: #BBAA97;">true</span>}
)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc159661" class="outline-2">
<h2 id="orgc159661">Opgave 14</h2>
<div class="outline-text-2" id="text-orgc159661">
<p>
Voeg een document toe met volgende kenmerken: <br />
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Object-id:</td>
<td class="org-left">001</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Name:</td>
<td class="org-left">Bulbasaur</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Type:</td>
<td class="org-left">grass, poison</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Stats:</td>
<td class="org-left">AttackScore:</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">DefenceScore:</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Speed:</td>
<td class="org-right">3</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-mongo">db.pokedex.insertOne({
  <span style="color: #528B8B;">"_id"</span>: <span style="color: #528B8B;">"001"</span>,
  <span style="color: #528B8B;">"name"</span>: <span style="color: #528B8B;">"Bulbasaur"</span>,
  <span style="color: #528B8B;">"type"</span>: [<span style="color: #528B8B;">"grass"</span>, <span style="color: #528B8B;">"poison"</span>],
  <span style="color: #528B8B;">"stats"</span>: [{
      <span style="color: #528B8B;">"attackScore"</span>: 3,
      <span style="color: #528B8B;">"defenceScore"</span>: 2,
      <span style="color: #528B8B;">"speed"</span>: 3
  }]
})
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf4e07db" class="outline-2">
<h2 id="orgf4e07db">Opgave 15</h2>
<div class="outline-text-2" id="text-orgf4e07db">
<p>
Wijzig bij het document met als Name ‘Metapod’ het kenmerk sort in cocoon.
</p>

<div class="org-src-container">
<pre class="src src-mongo">db.pokedex.update(
  {<span style="color: #528B8B;">"name"</span>: <span style="color: #528B8B;">"Metapod"</span>},
  {$set: {<span style="color: #528B8B;">"sort"</span>: <span style="color: #528B8B;">"cocoon"</span>}},
  {multi: <span style="color: #BBAA97;">true</span>}
)
</pre>
</div>
</div>
</div>

<div id="outline-container-org71742bf" class="outline-2">
<h2 id="org71742bf">Opgave 16</h2>
<div class="outline-text-2" id="text-org71742bf">
<p>
Voeg bij het document met als Name ‘Metapod’ volgend subdocument toe:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Stats:</td>
<td class="org-left">AttackScore:</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">DefenceScore:</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">SpecialAttack:</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-mongo">db.pokedex.update(
  {<span style="color: #528B8B;">"name"</span>: <span style="color: #528B8B;">"Metapod"</span>},
  {$push:
      {<span style="color: #528B8B;">"stats"</span>:{
          <span style="color: #528B8B;">"attackScore"</span>:1,
          <span style="color: #528B8B;">"defenceScore"</span>:3,
          <span style="color: #528B8B;">"specialAttack"</span>:1
      }}
  }
)
</pre>
</div>
<p>
<a href="../index.html">Home</a> &gt; <a href="mongodb.html">MongoDB</a> &gt; Herhalingsoefeningen
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Robin Wils</p>
<p class="date">Created: 2019-08-14 Wed 16:40</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
